import datetime
import math

weekdays = ['Понедельник', "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"]
group_OI = ['Хазин', "Ряжский", "Мовсесян", "Ширнин", "Горюнова", "Митин", "Мягков", "Благов", "Новиков", "Хаитова", "Смирнов", "Карасев"]
group_EN = ['Хазин', "Чурилов", "Мовсесян", "Ширнин", "Данилова", "Ляпина", "Штарев", "Лаврентьев", "Кудрявцев", "Ватутина" , "Карасев"]

def get_schedule(flag):
    now = datetime.datetime.today()
    first_saturday = datetime.datetime(2023, 9,2)
    distinction = math.ceil((now - first_saturday).days/7)
    if now.isoweekday() == 7:
        distinction += 1
    schedule = {
    'Понедельник': ['Разговоры о важном', "Алгебра", "Алгебра", "История", "История", "Английский", "Физика", "ЕГЭ Математика"],
    "Вторник":["Информатика", "Информатика", "Геометрия", "Геометрия", "Химия", "Химия", "Классный час"],
    "Среда": ["Ко второму", "Астрономия", "Физика", "Физика", "Английский", "ОБЖ"],
    "Четверг": ["Физика", "Физика", "Обществознание", "Обществознание", "Литература", "Английский"],
    "Пятница": ["Биология", "Литература", "Алгебра", "Алгебра", "Информатика", "Информатика", "Литература"],
    "Суббота": ["Физкульура", "Физкульура", "Алгебра" if distinction % 2 == 1 * flag else "Геометрия", "Алгебра" if distinction % 2 == 1 * flag else "Геометрия", "Биология", "Русский"]}
    return schedule

def get_timestable(weekday):
    if weekday == 'Понедельник' or weekday == 'Суббота':
        return ['8:00 - 8:45','8:45 - 9:25', '9:35 - 10:15', '10:30 - 11:10', '11:25 - 12:05', '12:20 - 13:00', '13:10 - 13:50', '14:05 - 14:45']
    return ['8:30 - 9:15', '9:25 - 10:10', '10:25 - 11:10', '11:25 - 12:10', '12:25 - 13:10', '13:20 - 14:05', '14:15 - 14:55']